{
    "chapter": "Digital Logic",
    "types": [
      {
        "numerical_type_id": "DL-DL-TYPE-01",
        "numerical_type_name": "Number Systems & Arithmetic",
        "numerical_type_description": "These questions test the understanding of various number systems (binary, octal, decimal, hexadecimal) and data representations. This includes conversions between bases, signed number representations (like 2's complement), and computer arithmetic for fixed-point and floating-point (IEEE 754 standard) numbers, including overflow conditions.",
        "question_ids": [
          "Q.5",
          "Q.8",
          "Q.7",
          "Q.4",
          "8",
          "45",
          "35",
          "Q.7",
          "Q.9",
          "1",
          "7",
          "9",
          "33",
          "29",
          "CS Q.18",
          "CS Q.4",
          "CS Q.44",
          "CS-Q.6",
          "Q.18",
          "Q.41",
          "Q.32",
          "Q.45",
          "Q.14",
          "Q.49",
          "Q.25",
          "Q.32",
          "Q.49"
        ]
      },
      {
        "numerical_type_id": "DL-DL-TYPE-02",
        "numerical_type_name": "Boolean Algebra & Logic Gates",
        "numerical_type_description": "These questions focus on the fundamental principles of Boolean algebra and the properties of logic gates. They involve manipulating and evaluating Boolean expressions, understanding concepts like duality and functional completeness, and implementing logic functions using a specific set of gates (e.g., universal gates like NOR or NAND).",
        "question_ids": [
          "Q.6",
          "6",
          "Q.13",
          "Q.21",
          "2",
          "Q. 39",
          "Q.8",
          "4",
          "28",
          "Q.30",
          "Q.24",
          "Q.50"
        ]
      },
      {
        "numerical_type_id": "DL-DL-TYPE-03",
        "numerical_type_name": "Logic Function Minimization",
        "numerical_type_description": "These questions are centered on the simplification of Boolean functions to their minimal forms. They require the use of techniques like Karnaugh maps (K-maps) or algebraic manipulation. Problems often involve handling 'don't care' conditions and identifying prime and essential prime implicants to find the most efficient two-level logic implementation.",
        "question_ids": [
          "Q.14",
          "Q.30",
          "7",
          "37",
          "43",
          "44",
          "21",
          "49",
          "CS Q.52",
          "Q.42",
          "Q.43"
        ]
      },
      {
        "numerical_type_id": "DL-DL-TYPE-04",
        "numerical_type_name": "Combinational Circuit Analysis & Design",
        "numerical_type_description": "These questions involve the analysis and design of combinational logic circuits, which are memoryless circuits whose outputs are a direct function of their current inputs. This includes standard components like multiplexers (MUX), decoders, encoders, and adders. Problems may involve determining the output function of a given circuit, implementing a function using these components, or calculating propagation delays.",
        "question_ids": [
          "31",
          "9",
          "Q.19",
          "Q.5",
          "45",
          "Q.8",
          "48",
          "Q.30",
          "Q.33",
          "19",
          "20",
          "CS Q.5",
          "Q.40",
          "Q.21",
          "Q.44",
          "Q.50",
          "Q.31"
        ]
      },
      {
        "numerical_type_id": "DL-DL-TYPE-05",
        "numerical_type_name": "Sequential Circuit Analysis & Design",
        "numerical_type_description": "These questions concern sequential circuits, which have memory and whose outputs depend on both current inputs and past states. They cover the analysis of circuits with flip-flops (D, T, JK), the design of counters with specific counting sequences, and the understanding of finite state machines (FSMs). This includes deriving state transition diagrams, determining output sequences, and calculating the number of states.",
        "question_ids": [
          "Q.27",
          "32",
          "Q.15",
          "Q.50",
          "Q.51",
          "7",
          "Q. 20",
          "Q. 37",
          "Q.8",
          "33",
          "22",
          "CS Q.28",
          "Q.43",
          "Q.59",
          "Q.60",
          "Q.34"
        ]
      }
    ]
  }